{
  "patchNoteList": [
    {
      "title": "2024-11-19",
      "contents": [
        "Changed the data source for website traffic statistics from Page Views to Requests.",
        "After this update, the experience points on the top left will increase significantly."
      ]
    },
    {
      "title": "2024-11-18",
      "contents": [
        "The free claim for Pyroxene is now limited to once a day.",
        "The amount of Pyroxene will no longer be reset after refreshing the page.",
        "The initial value of credit points is fixed at 50,000,000, and gambling will cost AP for each click now.",
        "The guide text has been updated to reflect the above changes."
      ]
    },
    {
      "title": "2024-11-17",
      "contents": [
        "Added C105 circle cut and Web Catalog link in the announcement."
      ]
    },
    {
      "title": "2024-11-16",
      "contents": [
        "Updated text in the message which appears when the site is updated."
      ]
    },
    {
      "title": "2024-11-14",
      "contents": [
        "Feature added to switch languages",
        "Changed the font to support multiple languages."
      ]
    },
    {
      "title": "2024-11-12",
      "contents": [
        "The announcement page has been updated to integrate patch notes and announcements into the same page."
      ]
    },
    {
      "title": "2024-11-08 (Temporary Update)",
      "contents": [
        "Added announcement for Comiket selection.",
        "Improved message content for viewing on non-recommended devices."
      ]
    },
    {
      "title": "2024-11-07",
      "contents": [
        "Profile screen added. (Click the level icon in the upper left to access it)"
      ]
    },
    {
      "title": "2024-11-05",
      "contents": [
        "Changed experience display method (total visit count remains unchanged).",
        "Added guide function for site introduction.",
        "Added buttons for Missions and Announcements.",
        "Added content to the Missions section.",
        "Updated icons and positions of some buttons.",
        "Added message for viewing on non-recommended devices."
      ]
    },
    {
      "title": "2024-11-03",
      "contents": [
        "Feature added to calculate experience based on site visit count.",
        "Added link to pixivFANBOX.",
        "Adjusted some text."
      ]
    },
    {
      "title": "2024-11-02",
      "contents": [
        "Added functionality to charge up to 999 AP.",
        "Added temporary background illustration.",
        "Added pop-up descriptions when hovering over icons.",
        "Adjusted some text."
      ]
    },
    {
      "title": "2024-11-01",
      "contents": [
        "Beta version released."
      ]
    }
  ]
}
